[Language]
DisplayName=한국어
[MainDlg]
MainDlg=PowerBox Toolbox
TitleFormat=%s (%s 표시/숨기기)
Tab1=프로세스
Tab2=시작 프로그램
Tab3=클립보드
Tab4=창
Tab5=파일
Tab6=Git
QuickTab1=AI 어시스턴트
QuickTabLaunch=빠른 실행
QuickTab2=시스템
QuickTab3=도구
[ProcessTab]
ColName=프로세스 이름
ColCPU=CPU%
ColPath=경로
ColMemory=메모리 (KB)
ColPID=PID
[StartupTab]
ColName=시작 프로그램 이름
ColCmd=명령어 (경로)
ColLocation=위치
ColStatus=상태
StatusEnabled=사용 가능
StatusDisabled=사용 안 함
[ClipboardTab]
ColText=텍스트 내용 (더블클릭하여 복사)
[WindowTab]
ColField=필드
ColValue=값
ColType=유형
ColTitle=창 제목
ColIndex=인덱스
TopmostLabel=항상 위[%zu]
TransparencyLabel=투명도: %d%%
TranparencyLabel=투명도: 100%
LocateBtn=창 찾기
ForceKillBtn=강제 종료
ScreenshotBtn=클립보드로 캡처
Handle=핸들
Path=경로
PID=PID
ProcName=프로세스 이름
RClickCancel=취소
RClickCloseWindow=창 닫기
RClickTopmost=항상 위 전환
Title=제목

[Msg]
CreateDlgFailed=대화 상자를 만들지 못했습니다.
GitMenuExec=실행
GitMenuCopy=명령어 복사
GitMenuEdit=명령어 편집
GitMenuDelete=삭제
DropGitFolderHint=폴더 또는 디렉터리를 여기로 끌어다 놓으세요.
DropFileHint=파일을 여기로 끌어다 놓으세요.
GitRepoDetached=HEAD가 분리됨
GitRepoBranch=브랜치: %s
GitNotRepo=Git 리포지토리가 아닙니다.
GitNoWorkDir=먼저 작업 디렉터리를 설정하세요.
GitCurrentBranch=현재 브랜치:
GitConfirmExec=다음 명령어를 실행하시겠습니까?\n\n%s\n\n%s
GitConfirmTitle=Git 명령어 실행 확인
GitResultWindowFailed=결과 창을 만들지 못했습니다.
GitCmdWindowFailed=Git 명령어 창을 만들지 못했습니다.
GitEditPrompt=명령어 편집:
EnterCommand=명령어를 입력하세요.
ExecCmdFailed=명령어 실행 실패: %s
PreventLockFailed=화면 잠금 방지에 실패했습니다.
PowerShellConfirm=PowerShell 실행 방식을 선택하세요:\n예 (Y) - 관리자 권한으로 실행\n아니오 (N) - 일반 모드
PowerShellTitle=PowerShell 실행
PowerShellNonAdminFailed=PowerShell 실행 실패: %s
PowerShellAdminFailed=관리자 권한 PowerShell 실행 실패: %s
WslLaunchFailed=WSL 실행에 실패했습니다.
OpenLinkFailed=링크를 열지 못했습니다.
GitBashNotFound=Git Bash를 찾을 수 없습니다. 설정을 확인하세요.
PleaseSelectProcess=먼저 프로세스를 선택하세요.
NoProcessSelected=선택한 프로세스가 없습니다.
ConfigApiKeyFirst=먼저 설정에서 AI API 키를 구성하세요.
AnalyzingProcesses=%d개의 프로세스를 분석 중입니다. 기다려주세요...
AiAnalysisFailed=AI 분석 실패:
ConfirmEndProcess=프로세스\n%s (PID: %s)를 종료하시겠습니까?
ConfirmEndProcessTitle=프로세스 종료 확인
ConfirmEndSameName=\"%s\" 이름의 모든 프로세스를 종료하시겠습니까?\n%d개의 인스턴스를 찾았습니다.
ProcessEnded=프로세스가 성공적으로 종료되었습니다.
ProcessEndFail=프로세스 종료 실패: %s
ProcessEndFailSimple=프로세스 종료에 실패했습니다.
CannotOpenProcess=종료할 프로세스를 열 수 없습니다. 오류: %s
CannotOpenProcessSimple=프로세스를 열 수 없습니다. 권한이 부족합니다.
BatchEndResult=%d개 프로세스 종료됨, %d개 실패.
BatchEndResultTitle=일괄 종료 결과
Success=성공
Error=오류
Warning=경고
ConfirmDelete=삭제 확인
AccessDenied=액세스 거부
Completed=완료
Info=정보
ConfirmForceKill=PID=%u를 강제 종료하시겠습니까?\n저장되지 않은 데이터가 손실될 수 있습니다.
ProcessForceKilled=프로세스가 강제 종료되었습니다.
ProcessForceKillFailed=프로세스 강제 종료에 실패했습니다.
InvalidWindow=먼저 창을 찾으세요.
CannotGetPID=프로세스 ID를 가져올 수 없습니다.
NoWindowSelected=유효한 창이 선택되지 않았습니다.
TopmostFail=항상 위 설정에 실패했습니다. 권한이 부족하거나 창에서 허용하지 않습니다.
FileNotFound=먼저 파일을 끌어다 놓으세요!
CopySuccess=복사본이 생성되었습니다!\n저장 위치: %s
CopyFail=복사본을 만들지 못했습니다. 오류 코드: %u
RenameSuccess=이름 변경 성공!
RenameFail=이름 변경 실패. 오류 코드: %u
DeleteConfirm=다음 파일을 휴지통으로 이동하시겠습니까?\n%s
DeleteSuccess=파일이 휴지통으로 이동되었습니다.
DeleteFail=파일 삭제 실패. 오류 코드: %d
StartupAdded=시작 프로그램 항목이 추가되었습니다.
StartupAddFail=시작 프로그램 항목 추가에 실패했습니다. 권한을 확인하세요.
StartupRemoved=시작 프로그램 항목이 제거되었습니다.
StartupRemoveFail=시작 프로그램 항목 제거에 실패했습니다. 권한을 확인하세요.
ConfirmRemoveStartup=시작 프로그램 항목\n%s을(를) 제거하시겠습니까?
ConfirmRemoveStartupDanger=위험한 작업입니다! 시작 프로그램 항목을 삭제합니다:\n%s\n위치: %s\n삭제 전에 자동 백업됩니다(레지스트리 값은 .reg로 내보내고 시작 폴더 파일은 휴지통으로 이동).\n계속하시겠습니까?
StartupBackupFailed=레지스트리 백업을 만들지 못했습니다. 삭제를 취소했습니다.
StartupToggleFail=시작 프로그램 항목을 사용/사용 안 함으로 전환하지 못했습니다. 권한을 확인하세요.
StartupRemovedWithBackup=시작 프로그램 항목을 제거했습니다.\n레지스트리 백업이 저장되었습니다:\n%s
NeedAdminRestart=관리자 권한으로 다시 시작할 수 없습니다. 프로그램을 수동으로 관리자 권한으로 실행하세요.
OleInitFail=OLE 초기화에 실패했습니다. 드래그 앤 드롭 기능을 사용할 수 없습니다.
EnterLocateModeFail=찾기 모드로 전환할 수 없습니다.
ConfigDefaultName=먼저 파일 > 설정 > 파일 이름 지정에서 기본 파일 이름을 구성하세요.
CannotGenUniqueName=고유한 파일 이름을 생성할 수 없습니다. 대상 디렉터리의 권한을 확인하거나 수동으로 다른 이름을 선택하세요.
ConfirmBatchEnd=일괄 종료 확인
ConfirmBatchEndMsg=선택한 %d개의 프로세스를 종료하시겠습니까?\n관련 프로그램이 비정상적으로 종료될 수 있습니다.
ConfirmForceKillTitle=강제 종료 확인
UnknownError=알 수 없는 오류
AiScanNoContent=AI 스캔이 완료되었지만 내용이 반환되지 않았습니다.
AiParseError=AI 응답 형식 오류, 유효한 JSON을 찾을 수 없습니다.
AiParseFailMsg=AI 응답 구문 분석 실패: %hs
ScanCompleteMsg=스캔 완료, %d개의 의심스럽거나 불필요한 프로세스를 찾았습니다.
CannotGetPath=프로세스 경로를 가져올 수 없습니다.
FileNotFoundMsg=파일을 찾을 수 없습니다.
NoProcessToEnd=종료할 프로세스가 없습니다.
EndAllPreviewMore=  ...그리고 %d개 프로세스 더\n
EndAllStep1=[경고] 목록에 있는 모든 %d개 프로세스를 종료하려고 합니다!\n\n이 작업은 되돌릴 수 없으며 다음을 유발할 수 있습니다:\n  · 프로그램 비정상 종료 또는 시스템 기능 오작동\n  · 저장되지 않은 데이터 손실\n  · AI 분석이 부정확한 경우 중요한 시스템 구성 요소에 영향\n\n다음 프로세스를 종료할 수 있는지 확인하세요:\n%s\n\n결과를 이해하고 계속하시겠습니까?
EndAllStep1Title=경고: 모두 종료 (1단계 확인)
EndAllStep2=최종 확인: 목록에 있는 모든 %d개 프로세스를 강제 종료하시겠습니까?\n이러한 프로세스가 시스템 정상 작동에 중요하지 않음을 다시 한 번 확인하세요.
EndAllStep2Title=최종 확인: 모두 종료
EndAllResult=모두 종료 작업 완료:\n성공: %d, 실패: %d
EndAllResultTitle=모두 종료 결과
EndAllDone=모두 종료 작업이 완료되었습니다.
Scanning=프로세스 스캔 중...
GitNoPathError=먼저 Git 작업 디렉터리를 설정하세요.
BashNotFound=오류: bash.exe를 찾을 수 없습니다.\n설정에서 Git Bash 경로를 구성하세요.
PipeCreateError=오류: 파이프를 만들 수 없습니다.
ProcessStartError=오류: 프로세스를 시작할 수 없습니다 (오류 코드: %lu)\n명령줄: %s
ExitCode=종료 코드
NoOutput=(출력 없음)
AiGenFail=AI 명령어 생성에 실패했습니다. API 키와 네트워크 연결을 확인하세요.
PleaseEnterQuestion=질문 설명을 입력하세요.
PleaseConfigApiKey=먼저 설정에서 API 키를 구성하세요.
InputFormatHint=형식: 설명|명령어
NoWorkDirSet=먼저 Git 작업 디렉터리를 설정하세요.
PleaseSelectProcess=최소 하나의 프로세스를 선택하세요.
ConfirmEndProcesses=다음 %zu개의 프로세스를 종료하시겠습니까?\n\n
EndMoreHint=  ... %zu개 더\n
UnsavedDataWarning=\n\n저장되지 않은 데이터가 손실될 수 있습니다!
Confirm=확인
NoLockFound=잠금 프로세스를 찾을 수 없습니다.
ConfirmEndAllLocks=모든 %zu개의 잠금 프로세스를 종료하시겠습니까?\n\n저장되지 않은 데이터가 손실될 수 있습니다!
None=없음
ConfirmEndAllTitle=모두 종료 확인
MsgConfirmEndProcessTitle=프로세스 종료 확인
MsgEndProcess=프로세스 종료
MsgEndAllSameName=동일한 이름 모두 종료
MsgLocate=찾기
MsgAiAnalyze=AI 분석
MsgBatchEndComplete=일괄 종료 완료
MsgFileNotFound=파일을 찾을 수 없음
MsgNoProcessSelected=선택한 프로세스 없음
MsgConfigApiKeyFirst=먼저 설정에서 AI API 키를 구성하세요.
MsgAiScanFail=AI 스캔
MsgAiScanFailed=AI 스캔에 실패했습니다. 네트워크 연결과 API 키를 확인하세요.
MsgScanning=스캔 중
MsgForceKill=강제 종료
MsgConfirmForceKill=강제 종료 확인
MsgTopmostFail=항상 위 설정 실패
MsgLocateWindowFirst=먼저 창을 찾으세요.
MsgCannotGetPID=PID를 가져올 수 없음
MsgCloseWindow=창 닫기
MsgConfirmClose=닫기 확인
MsgScreenshotSaved=스크린샷 저장됨
MsgCopySuccess=복사 성공
MsgRenameSuccess=이름 변경 성공
MsgMoveSuccess=이동 성공
MsgDeleteSuccess=삭제 성공
MsgStartup=시작 프로그램
MsgConfirmDelete=삭제 확인
MsgCompleted=완료
MsgError=오류
MsgCannotOpenProcess=프로세스를 열 수 없음
MsgAccessDenied=액세스 거부
MsgForceKillFail=강제 종료 실패
MsgInvalidWindow=잘못된 창
MsgWindowSizeInvalid=잘못된 창 크기
MsgClipboardFail=클립보드 오류
MsgCannotGetPath=경로를 가져올 수 없음
MsgCannotBrowse=찾아볼 수 없음
MsgWarning=경고
MsgConfirm=확인
MsgNotAvailable=해당 없음
MsgSigned=유효함
MsgUnsigned=유효하지 않음/서명 없음
MsgNoCompany=없음
MsgNoOrigName=없음
MsgProcessListEmpty=프로세스 목록이 비어 있습니다.
MsgPleaseRefresh=먼저 프로세스 목록을 새로 고치세요.
MsgEndProcessTitle=프로세스 종료
MsgPleaseEnterCommand=실행할 명령어를 입력하세요.
MsgRunCmdFailed=명령어 실행 실패
MsgPreventLockFail=시스템 잠금 방지 상태 설정에 실패했습니다.
MsgPowerShellFail=PowerShell 시작 실패
MsgPowerShellAdminFail=관리자 권한 PowerShell 시작 실패
MsgWSLFail=WSL 시작에 실패했습니다. wsl.exe를 수동으로 실행하세요.
MsgLinkFail=링크를 열 수 없음
MsgGitBashNotFound=git-bash.exe를 찾을 수 없습니다. 설정에서 Git Bash 경로를 구성하세요.
MsgCmdWindowFail=Git 명령어 창을 만들 수 없습니다.
MsgSetWorkDirFirst=먼저 작업 디렉터리를 설정하세요.
MsgConfirmExec=실행 확인
MsgExecCmd=명령어 실행
MsgResultWindowFail=결과 창을 만들 수 없습니다.
MsgEndProcessAll=동일한 이름 모두 종료
MsgBatchEndConfirm=일괄 종료 확인
MsgTaskManagerFail=작업 관리자 시작 실패
MsgProcessPathEmpty=프로세스 경로가 비어 있습니다.
MsgFileNotFoundBrowse=파일을 찾을 수 없습니다. 액세스할 수 없거나 프로세스가 종료되었을 수 있습니다.
MsgConfirmDeleteFile=파일 삭제 확인
MsgFileNameEmpty=파일 이름은 비울 수 없습니다.
MsgInvalidFileName=파일 이름 또는 확장자에 잘못된 문자가 포함되어 있습니다.
MsgTargetFileExists=대상 파일이 이미 존재합니다. 다른 이름을 선택하세요.
MsgTargetPathInvalid=대상 경로가 잘못되었습니다. 유효한 디렉터리를 입력하거나 선택하세요.
MsgTargetNotDir=대상 경로가 디렉터리가 아닙니다. 폴더를 선택하세요.
MsgCannotGenUniqueName=고유한 파일 이름을 생성할 수 없습니다. 디렉터리를 확인하거나 수동으로 다른 이름을 선택하세요.
MsgTargetExists=대상 디렉터리에 같은 이름의 파일이 이미 있습니다. 제거하거나 대상 경로를 변경하세요.
MsgCannotGetAppPath=응용 프로그램 경로를 가져올 수 없습니다.
MsgRegAccessFail=레지스트리 키를 열 수 없습니다. 권한을 확인하세요.
MsgStartupRemoved=시작 프로그램 항목이 제거되었습니다.
MsgStartupRemoveFail=시작 프로그램 항목 제거에 실패했습니다. 권한을 확인하세요.
MsgStartupAdded=시작 프로그램 항목이 추가되었습니다.
MsgStartupAddFail=시작 프로그램 항목 추가에 실패했습니다. 권한을 확인하세요.
MsgConfirmRemoveStartup=시작 프로그램 항목을 제거하시겠습니까?
MsgAiNoApiKey=AI 분석
MsgSelectProcessFirst=먼저 분석할 프로세스를 선택하세요.
MsgConfigApiKey=먼저 설정에서 AI API 키를 구성하세요.
MsgRefreshProcessList=먼저 프로세스 목록을 새로 고치세요.
MsgCreateProcessFail=프로세스 생성 실패
MsgAdminRestartFail=관리자 권한으로 다시 시작할 수 없습니다. 프로그램을 수동으로 관리자 권한으로 실행하세요.
MsgOleInitFail=OLE 초기화에 실패했습니다. 드래그 앤 드롭 기능을 사용할 수 없습니다.
MsgEnterLocateModeFail=찾기 모드로 전환할 수 없습니다.
MsgConfigDefaultName=먼저 파일 > 설정 > 파일 이름 지정에서 기본 파일 이름을 구성하세요.
MsgConfirmDeleteStartup=시작 프로그램 항목을 삭제하시겠습니까?
MsgYesNo=예/아니오
HighRiskWarningTitle=고위험 작업 경고
HighRiskPrompt=이 작업은 고위험 작업입니다. 계속하려면 \"실행 확인\"을 입력하세요:
AiScanFailedStatus=AI 스캔 실패: %s
AiScanFailedMsg=AI 스캔에 실패했습니다. 네트워크 연결과 API 키를 확인하세요.\n%s
NeedAdminRestart=관리자 권한으로 다시 시작할 수 없습니다. 프로그램을 수동으로 관리자 권한으로 실행하세요.
InvalidJsonCmd=명령어를 구문 분석할 수 없습니다. 잘못된 JSON 형식입니다.
AiCmdConfirmFmt=AI가 다음 명령어 실행을 요청합니다:\n\n명령어: %s\n\n목적: %s\n\n위험 수준: %s
HighRiskConfirmText=실행 확인
InputMismatchCancel=입력이 일치하지 않아 작업이 취소되었습니다.
Cancelled=취소됨
ExecConfirm=실행 확인
CmdCancelledFmt=[명령어 실행 결과]\n명령어: %s\n상태: 취소됨 (사용자가 확인하지 않음)\n
ExecFailedErrCode=실행 실패, 오류 코드: %d
CannotCreatePipe=오류: 출력 파이프를 만들 수 없습니다.
OutputLabel=출력:\n
ExitCodeFmt=종료 코드: %d\n
PromptRestartAdminMsg=이 작업에는 관리자 권한이 필요합니다. 관리자 권한으로 프로그램을 다시 시작하시겠습니까?
NeedPermission=권한 필요
ShellWindowFailed=셸 창을 가져오지 못했습니다.
ShellPidFailed=셸 프로세스 ID를 가져오지 못했습니다.
Valid=유효함
ValidPrefix=유효함 (
InvalidNoSig=유효하지 않음 또는 서명 없음
ProcInfoFmt=[프로세스 이름] %s (PID: %s)\n[경로] %s\n[서명] %s\n[회사] %s\n[원본 이름] %s
AddStartupFail=시작 프로그램 항목을 추가하지 못했습니다! 권한을 확인하세요.
AiAnalyze=AI 분석
AiScan=AI 스캔
AutoStartDisabled=자동 시작 비활성화됨
AutoStartEnabled=자동 시작 활성화됨
CannotGetExePath=실행 파일 경로를 가져올 수 없음
CannotOpenProcErr=프로세스를 열 수 없음, 오류: %s
CannotOpenRegKey=레지스트리 키를 열 수 없음
ClipboardFail=클립보드 작업 실패
ConfirmCloseTitle=닫기 확인
ConfirmCloseWindow=선택한 창을 닫으시겠습니까?
CopyFileSuccess=파일이 성공적으로 복사되었습니다!
CopySuffix=복사본
DeleteStartupFail=시작 프로그램 항목을 삭제하지 못했습니다! 권한을 확인하세요.
DestNotDir=대상이 디렉터리가 아닙니다.
FileAlreadyExists=파일이 이미 존재합니다.
FileNameEmpty=파일 이름이 비어 있습니다.
FileNotFoundForProcess=프로세스에 대한 파일을 찾을 수 없습니다.
InvalidDestPath=잘못된 대상 경로
InvalidFileNameChars=파일 이름에 잘못된 문자가 포함되어 있습니다.
InvalidWindowSize=잘못된 창 크기
MoveFail=이동 실패, 오류 코드: %u
MoveSuccess=이동 성공!
NoPathForProcess=프로세스 경로가 비어 있습니다.
NoSignature=디지털 서명 없음
ProcessForceKillFail=프로세스 강제 종료에 실패했습니다.
RefreshProcessListFirst=먼저 프로세스 목록을 새로 고치세요.
ScreenshotSavedTo=스크린샷 저장 위치: %s
TargetFileExists=대상 파일이 이미 존재합니다.
TaskMgrFail=작업 관리자 실행 실패
[ProcessAiResult]
BtnCopy=결과 복사
BtnSave=결과 저장
BtnClose=닫기
DefaultFileName=AI분석결과.txt
FileFilter=텍스트 파일 (*.txt)|*.txt|모든 파일 (*.*)|*.*||


[ProcessMenu]
EndProcess=프로세스 종료
EndSameName=동일한 이름 모두 종료
Locate=찾기
AiAnalyze=AI 분석
[StartupMenu]
Add=시작 프로그램 항목 추가
AddMachine=컴퓨터 시작 항목 추가
Enable=사용
Disable=사용 안 함
Remove=시작 프로그램 항목 제거
CopyPath=경로 복사
[TrayMenu]
ShowWindow=창 표시
Exit=종료
[FileTab]
DropHint=파일을 여기에 놓으세요.
[GitTab]
OpenGitHub=GitHub 열기
ClearPath=경로 지우기
GitBash=Git Bash
CmdWindow=명령 프롬프트
Locate=찾기
DefaultDir=(기본값)
ColDesc=설명
ColCmd=명령어
[GitCommands]
Cmd1Desc=로컬 리포지토리 초기화
Cmd2Desc=모든 파일 스테이징
Cmd3Desc=로컬 리포지토리에 커밋
Cmd4Desc=리모트 오리진 추가
Cmd5Desc=브랜치 이름을 main으로 변경
Cmd6Desc=푸시 및 업스트림 설정
Cmd7Desc=리모트 업데이트 가져오기
Cmd8Desc=리모트 리포지토리 복제
Cmd9Desc=상태 확인
Cmd10Desc=모든 변경 사항 스테이징
Cmd11Desc=로컬 리포지토리에 커밋
Cmd12Desc=리모트로 푸시
Cmd13Desc=모든 브랜치 표시 (리모트 포함)
Cmd14Desc=브랜치 생성 및 전환
Cmd15Desc=브랜치 전환
Cmd16Desc=브랜치를 현재 브랜치에 병합
Cmd17Desc=병합된 브랜치 삭제
Cmd18Desc=간결한 커밋 로그 보기
Cmd19Desc=작업 트리 변경 사항 복원
Cmd20Desc=스테이징 취소
[Shutdown]
Restart1Min=1분 후 다시 시작
Shutdown3Min=기본 3분 후 종료
CustomTime=설정 시간에 종료
[AutoClicker]
StoppedTitle=자동 클리커
StoppedMsg=자동 클릭이 중지되었습니다.
StatusStopped=중지됨
StatusClicking=클릭 중 (%c를 누르면 중지)
StatusWaiting=대기 중 (%c를 누르면 시작, %c를 누르면 중지)
VbsPrompt=클릭 간격 (ms/클릭):
VbsTitle=자동 클리커
LabelInterval=간격 (ms):
[AI]
ReadyMsg=AI 어시스턴트 준비 완료<br><span style='font-size:13px;'>이 도구 상자에 대해 무엇이든 물어보세요!</span>
NoApiKey=<div style='color:red;'>[오류] %s에 대한 API 키가 구성되지 않았습니다. 파일 > 설정 > AI 어시스턴트로 이동하여 구성하세요.</div>
[Settings]
LanguageLabel=언어
LanguageRestartHint=언어를 변경하면 응용 프로그램이 자동으로 다시 시작됩니다.
TabPath=경로
TabTemplate=이름 지정
TabAutoClicker=자동 클리커
TabAI=AI 어시스턴트
AIVendor=AI 공급업체
AIKey=API 키
AIShow=표시
AIHide=숨기기
TabScreenshot=스크린샷
TabStickyNote=메모장
TabSites=사이트
TabLanguage=언어
GroupFileNaming=파일 이름 지정
LabelDefaultName=기본 파일 이름:
GroupPathSettings=경로 설정
LabelScreenshot=스크린샷 저장 디렉터리:
LabelStickyDir=메모 저장 디렉터리:
BtnBrowse=찾아보기
LabelClickInterval=클릭 간격 (ms):
LabelStartKey=시작 키:
LabelStopKey=중지 키:
GroupAI=AI 어시스턴트
LabelVendor=공급업체:
LabelApiKey=API 키:
BtnShow=표시
BtnHide=숨기기
GroupLanguage=언어
LabelLanguage=언어:
BtnOK=확인
BtnCancel=취소
GroupAutoClicker=자동 클리커
DlgTitleScreenshot=스크린샷 저장 디렉터리 선택
DlgTitleSticky=메모 저장 디렉터리 선택
MsgKeySame=시작 키와 중지 키는 동일할 수 없습니다. 다시 구성하세요.
GroupHotkey=핫키
LabelHotkeyShowHide=창 표시/숨기기:
LabelHotkeyLocate=창 찾기:
BtnHotkeyCapture=캡처
MsgHotkeyDuplicate=중복된 핫키: 표시/숨기기 및 창 찾기가 동일한 키 조합을 사용합니다. 다시 구성하세요.
GroupGit=Git
LabelGitBash=Git Bash 경로:
DlgTitleGitBash=Git Bash 경로 선택
[ContextMenu]
ColLocation=위치
ColDisplayName=표시 이름
ColType=유형
ColVisibility=표시 여부
ColKeyName=키 이름
ColCommand=명령어
TypeStatic=정적
TypeShellEx=ShellEx
Visible=표시
Hidden=숨김
Extended=확장
Disabled=비활성화
Enabled=활성화
RClickEnable=활성화
RClickDisable=비활성화
RClickEnableSelected=선택 항목 활성화
RClickDisableSelected=선택 항목 비활성화
RClickDelete=삭제
RClickLocate=찾기
RClickLocateReg=찾기 (레지스트리)
RClickCustomParse=사용자 정의 이름 구문 분석
RClickAiAnalyze=AI 분석
RClickEnableAll=모두 활성화
FolderMenuLabel=폴더 컨텍스트 메뉴: 이 프로그램으로 열기
Win11ClassicLabel=Win11 클래식 메뉴 (Shift+우클릭)
BtnRefresh=새로 고침
BtnDelete=삭제
BtnLocate=찾기
BtnRebuild=사전 다시 빌드
BtnDictPath=사전 경로
BtnDictOpen=사전 열기
BtnUndo=실행 취소
BtnHistory=기록
BtnQuery=쿼리
ExtensionPlaceholder=파일 확장자 입력 (점은 선택 사항)
LabelLocation=위치 필터:
StatusReady=준비됨
SceneAll=모두
SceneFile=파일 (*)
SceneFolder=폴더 (모든 폴더)
SceneVirtualFolder=폴더 (가상 폴더)
SceneDirBackground=디렉터리 배경
SceneDesktopBg=바탕 화면 배경
SceneDrive=드라이브
SceneAllFiles=모든 파일
SceneThisPC=내 PC
SceneRecycleBin=휴지통
SceneLibrary=라이브러리 폴더
SceneUWP=UWP 바로 가기
SceneExe=exe 파일
SceneUnknown=알 수 없는 파일
SceneShortcut=바로 가기
SceneJpg=.jpg / .jpeg (JPEG 이미지)
ScenePng=.png (PNG 이미지)
SceneGif=.gif (GIF 이미지)
SceneBmp=.bmp (BMP 이미지)
SceneTxt=.txt (텍스트 파일)
ScenePdf=.pdf (PDF 문서)
SceneDoc=.doc / .docx (Word 문서)
SceneMp4=.mp4 (비디오 파일)
SceneMp3=.mp3 (오디오 파일)
SceneZip=.zip / .rar (압축 아카이브)
SceneExeFile=.exe (실행 파일)
SceneDll=.dll (라이브러리 파일)
SceneHtml=.html / .htm (웹 페이지)
StatusFoundItems=%d개의 컨텍스트 메뉴 항목을 찾았습니다.
StatusDictPath=  |  사전: %s
StatusDictEmbeddedCache=  |  사전: 내장 + 캐시 (%s)
StatusDictEmbedded=  |  사전: 내장 (하드코딩)
StatusQueryExt=확장자 %s 쿼리: %d개의 컨텍스트 메뉴 항목을 찾았습니다.
StatusFolderMenuAdded=폴더 컨텍스트 메뉴 항목이 추가되었습니다.
StatusFolderMenuRemoved=폴더 컨텍스트 메뉴 항목이 제거되었습니다.
StatusWin11Enabled=Win11 클래식 메뉴가 활성화되었습니다. 탐색기 다시 시작 중...
StatusWin11Disabled=Win11 새 메뉴가 복원되었습니다. 탐색기 다시 시작 중...
StatusToggleFormat=%s: %s
StatusActionEnabled=활성화됨
StatusActionDisabled=비활성화됨
StatusDisabledCount=%d개 항목이 비활성화됨
StatusEnabledCount=%d개 항목이 활성화됨
StatusCustomParseDeleted=%s에 대한 사용자 정의 구문 분석이 삭제되었습니다.
StatusCustomParseSaved=%s에 대한 사용자 정의 구문 분석이 저장됨: %s
StatusDictPathUpdated=사전 폴더 업데이트됨: %s
StatusRebuildProgress=사전 다시 빌드 중: %d CLSID (%d개 시나리오), 잠시 기다려주세요...
StatusRebuildComplete=사전 다시 빌드 완료: %d/%d CLSID 해결됨 (레지스트리: %d, COM: %d, 대체: %d). 캐시: %s
StatusRebuildFailed=사전 다시 빌드 완료: %d/%d CLSID 해결됨, 그러나 캐시 저장 실패.
StatusNoClsidFound=ShellEx CLSID를 찾을 수 없습니다. 다시 빌드가 필요하지 않습니다.
StatusBackupDirFail=백업 디렉터리를 만들 수 없습니다.
MsgBackupFail=레지스트리 백업을 만들지 못했습니다. 작업을 취소했습니다.
StatusUndoFormat=실행 취소됨: %s
StatusHistoryRecent=... (최근 50개 기록만 표시)
DictInfoCurrent=현재 사전: %s  |  캐시: %s
DictInfoEmbeddedCache=현재 사전: 내장 + 캐시  |  캐시: %s
DictInfoEmbedded=현재 사전: 내장 (하드코딩)  |  캐시: %s
InputExtHint=쿼리할 파일 확장자를 입력하세요. 예: .mp4, .txt 등
ConfirmDisable=비활성화 확인
ConfirmEnable=활성화 확인
ConfirmUndo=실행 취소 확인
ConfirmRebuild=다시 빌드 확인
MsgNoSelection=먼저 항목을 선택하세요.
MsgNoHistory=작업 기록이 없습니다.
MsgNoHistoryUndo=실행 취소할 작업이 없습니다.
MsgItemNotFound=해당 메뉴 항목을 찾을 수 없습니다. 삭제되었을 수 있습니다.
MsgAllSelectedDisabled=선택한 모든 항목이 이미 비활성화되어 있습니다.
MsgAllSelectedEnabled=선택한 모든 항목이 이미 활성화되어 있습니다.
MsgNoClsid=이 항목의 CLSID를 가져올 수 없습니다. 사용자 정의 구문 분석을 수행할 수 없습니다.
MsgEnterCustomName=CLSID: %s\n현재 이름: %s\n\n사용자 정의 표시 이름을 입력하세요 (비워두면 사용자 정의 구문 분석이 삭제됩니다):
MsgDictFolderNotFound=사전 폴더가 존재하지 않습니다.
MsgCantParseShellExPath=ShellEx 레지스트리 경로를 구문 분석할 수 없습니다.
MsgCantOpenRegKey=레지스트리 키를 열 수 없습니다: %s\n오류 코드: %d
MsgCopyRegKeyFailed=레지스트리 키 복사에 실패했습니다.\n\n소스: %s\%s\n대상: %s\%s
MsgDeleteOldRegFailed=이전 레지스트리 키 삭제에 실패하여 롤백했습니다.\n오류 코드: %d
MsgUnrecognizedShellEx=알 수 없는 ShellEx 폴더: %s
MsgAiNoApiKey=먼저 파일 > 설정 > AI 어시스턴트에서 API 키를 구성하세요.
MsgAiAnalyzeFail=AI 분석 실패: %s
MsgAiAnalyzeResult=AI 분석 결과
MsgConfirmDisableCount=%d개의 컨텍스트 메뉴 항목을 비활성화하시겠습니까?\n비활성화된 항목은 우클릭 메뉴를 통해 다시 활성화할 수 있습니다.
MsgConfirmEnableCount=%d개의 컨텍스트 메뉴 항목을 활성화하시겠습니까?
MsgCriticalWarning=경고: 선택한 항목 중 일부는 시스템에 중요한 컨텍스트 메뉴 항목입니다!\n\n이를 비활성화하면 Windows 탐색기의 정상적인 동작에 영향을 미칠 수 있습니다.\n수정 전에 레지스트리 백업이 자동으로 생성됩니다.\n\n계속하시겠습니까?
MsgCriticalWarningTitle=중요 경고 - 비활성화 확인
MsgUndoConfirm=다음 작업을 실행 취소하시겠습니까?\n\n시간: %s\n작업: %s\n항목: %s\n세부 정보: %s\n\n이렇게 하면 항목이 이전 상태로 복원됩니다.
MsgUndoConfirmTitle=실행 취소 확인
MsgOpenSourceParentFail=소스 레지스트리 키를 열 수 없습니다.
MsgCreateTargetFail=대상 레지스트리 키를 만들 수 없습니다.
MsgRebuildPrompt=등록된 모든 ShellEx CLSID를 스캔하고 레지스트리 및 COM 인터페이스를 통해 표시 이름을 확인합니다.\n이 프로세스는 몇 초가 걸릴 수 있습니다. 계속하시겠습니까?
MsgHistoryTitle=작업 기록 (최신순)
CustomParseTitle=사용자 정의 이름 구문 분석
RebuildTitle=사전 다시 빌드
AiAnalyzeTitle=AI 분석
AiPromptHeader=Windows 우클릭 메뉴 레지스트리 항목 분석:
AiPromptScene=시나리오: %s
AiPromptKeyName=키 이름: %s
AiPromptDisplayName=표시 이름: %s
AiPromptCommand=명령어: %s
AiPromptType=유형: %s
AiPromptFooter=이 우클릭 메뉴 항목이 어떤 소프트웨어에 속하고 어떤 기능을 제공하는지 추측하세요. 30자 이내로 답변하세요.
MsgConfirmDisable=비활성화 확인

[EnvVar]
ColName=변수 이름
ColValue=변수 값
SystemLabel=시스템 변수
UserLabel=사용자 변수
BtnAdd=추가
BtnEdit=편집
BtnDelete=삭제
BtnRefresh=새로 고침
BtnExport=내보내기
SearchPlaceholder=환경 변수 검색...
LabelSearch=검색:
RClickEdit=편집
RClickDelete=삭제
RClickCopyName=이름 복사
RClickCopyValue=값 복사
RClickCopy=복사
RClickMoveUp=위로 이동
RClickMoveDown=아래로 이동
DlgAddTitle=환경 변수 추가
DlgEditTitle=환경 변수 편집
DlgConfirmDelete=삭제 확인
DlgWriteFail=쓰기 실패
DlgDeleteFail=삭제 실패
DlgExportFail=내보내기 실패
PathListCol=경로 항목
PathEditTitle=%s 변수 편집
PathSelectFolder=추가할 폴더 선택
PathSelectNewFolder=새 경로 선택
StatusRefreshed=새로 고침됨
StatusCopiedName=이름 복사됨: %s
StatusCopiedValue=값 복사됨: %s
StatusExported=내보낸 위치: %s
StatusAdded=%s 변수 추가됨: %s | 백업: %s
StatusUpdated=%s 변수 업데이트됨: %s | 백업: %s
StatusDeleted=%s 변수 삭제됨: %s | 백업: %s
StatusSearch=\"%s\" 검색: 시스템 %d/%d, 사용자 %d/%d
StatusTotal=시스템: %d개 변수 | 사용자: %d개 변수
ConfirmAddType=시스템 변수 또는 사용자 변수를 추가하시겠습니까?\n\n예=시스템, 아니오=사용자
ConfirmDeleteVar=%s 변수 \"%s\"을(를) 삭제하시겠습니까?
ErrNameEmpty=변수 이름은 비울 수 없습니다.
ErrSelectEdit=편집할 항목을 선택하세요.
ErrSelectDelete=삭제할 항목을 선택하세요.
ErrSelectVar=편집할 변수를 선택하세요.
ErrSelectVarDel=삭제할 변수를 선택하세요.
ErrWriteFail=변수 %s을(를) 쓸 수 없습니다.\n\n시스템 변수를 수정하려면 관리자 권한이 필요할 수 있습니다.
ErrDeleteFail=변수 %s을(를) 삭제할 수 없습니다.\n\n시스템 변수를 삭제하려면 관리자 권한이 필요할 수 있습니다.
ErrCreateFile=파일을 만들 수 없습니다.
ExportFilter=텍스트 파일 (*.txt)|*.txt|Env 파일 (*.env)|*.env|모든 파일 (*.*)|*.*||
[FileLock]
ColFilePath=파일 경로
ColProcessName=프로세스 이름
ColPID=PID
ColType=프로세스 유형
ColProcessPath=프로세스 경로
BtnEnd=종료
BtnEndAll=모두 종료
BtnLocate=찾기
BtnRefresh=새로 고침
BtnClear=지우기
Hint=잠금 프로세스를 보려면 파일을 여기에 놓으세요 (관리자 권한 필요)
HintLoaded=%zu개 파일 로드됨, %zu개 잠금 발견됨
AppTypeMainWindow=주 창
AppTypeOtherWindow=기타 창
AppTypeService=서비스
AppTypeExplorer=탐색기
AppTypeConsole=콘솔
AppTypeCritical=중요 프로세스
AppTypeUnknown=알 수 없음
AppTypeLocked=잠김
AppTypeNotLocked=잠기지 않음
AppTypeNotFound=찾을 수 없음
AppTypeScanning=스캔 중...
[BatchRename]
ColOriginal=원본 이름
ColNew=새 이름
ColStatus=상태
TabFolder=폴더
TabFile=파일 일괄
BtnBrowse=찾아보기
BtnPreview=미리 보기
BtnExecute=실행
BtnUndo=실행 취소
BtnRefresh=새로 고침
BtnAiAssistant=AI 어시스턴트
BtnResetAll=모두 재설정
PrefixLabel=접두사
SuffixLabel=접미사
ReplaceFromLabel=찾기
ReplaceToLabel=바꾸기
NumberLabel=자동 번호
RegexLabel=정규식
IgnoreExtLabel=확장자 무시
IgnoreMatchLabel=일치 항목 무시
TrackExtLabel=확장자 추적
TrackMatchLabel=일치 항목 추적
DeleteMatchLabel=일치 항목 삭제
NumberAfterExt=확장자 뒤에 번호 매기기
BtnClear=지우기
BtnRenameDir=폴더 이름 변경
BtnMoveDir=폴더 이동
BtnDeleteDir=폴더 삭제
BtnRename=이름 변경
BtnMove=이동
BtnDelete=삭제
BtnSelectAll=모두 선택
BtnDeselectAll=모두 선택 해제
BtnClearDelete=삭제 표시 지우기
BtnRegexHelp=정규식 가이드
BtnClearIgnore=모든 무시 지우기
BtnClearTrack=모든 추적 지우기
CheckInvert=반전
CheckIgnoreExt=확장자 무시 (세미콜론 구분)
CheckIgnoreMatch=일치 항목 무시 (확장자 포함)
CheckTrackExt=확장자 추적 (세미콜론 구분)
CheckTrackMatch=일치 항목 추적 (확장자 포함)
LabelFolder=폴더:
LabelCurrentDir=현재 디렉터리:
LabelSubdir=하위 디렉터리:
LabelStartNum=시작:
LabelTip=팁: 확장자는 수정되지 않습니다. 파일 목록에서 우클릭하여 삭제/무시/추적을 표시하세요.
GroupIgnore=무시 규칙
GroupTrack=추적 규칙
ColSerial=#
ColFolderName=폴더 이름
BrowseTitle=폴더 선택
DragFolderOnly=드래그 앤 드롭은 폴더만 지원됩니다.
Tip=팁
SelectedCount=선택: %d/%d
SelectFoldersFirst=먼저 폴더를 선택하세요.
EnterNewFolderName=새 폴더 이름을 입력하세요:
RenameFolder=폴더 이름 변경
InvalidFolderName=폴더 이름에 잘못된 문자가 포함되어 있습니다.
RenameFailed=이름 변경에 실패했습니다.
RenameSuccess=이름 변경에 성공했습니다.
Result=결과
RenameResult=이름 변경: %d개 성공, %d개 실패.
SelectFoldersToMove=먼저 이동할 폴더를 선택하세요.
SelectTargetFolder=대상 폴더 선택
MoveResult=이동: %d개 성공, %d개 실패.
SelectFoldersToDelete=먼저 삭제할 폴더를 선택하세요.
ConfirmDeleteFolders=선택한 %d개 폴더를 휴지통으로 이동하시겠습니까?
ConfirmDelete=삭제 확인
DeleteResult=삭제: %d개 성공, %d개 실패.
SelectFolderFirst=먼저 폴더를 선택하세요.
EnterNewDirName=새 디렉터리 이름을 입력하세요:
RenameCurrentDir=현재 디렉터리 이름 변경
InvalidDirName=디렉터리 이름에 잘못된 문자가 포함되어 있습니다.
ConfirmMoveDir=\"%s\"을(를) \"%s\"(으)로 이동하시겠습니까?
ConfirmMove=이동 확인
MoveFailed=이동에 실패했습니다.
MoveSuccess=이동에 성공했습니다.
ConfirmDeleteCurrentDir=현재 디렉터리 \"%s\" 및 모든 내용을 휴지통으로 이동하시겠습니까?
MoveToRecycleFailed=휴지통으로 이동하지 못했습니다.
DeleteSuccess=삭제에 성공했습니다.
AlreadyAtTop=항목이 이미 맨 위에 있습니다. 더 이상 위로 이동할 수 없습니다.
EnterTargetPosition=대상 위치 입력 (1 - %d):
MoveTo=이동 대상
EnterValidNumber=1에서 %d 사이의 숫자를 입력하세요.
AlreadyAtBottom=항목이 이미 맨 아래에 있습니다. 더 이상 아래로 이동할 수 없습니다.
EnterTargetPositionRange=대상 위치 입력 (%d - %d):
MoveToBottom=맨 아래로 이동
EnterValidNumberRange=%d에서 %d 사이의 숫자를 입력하세요.
MarkedDeleted=삭제됨
Ignored=무시됨
TrackPrefix=[추적]
AiPrefix=[AI]
PreviewFirst=먼저 미리 보기를 통해 결과를 확인하세요.
ConfirmExecute=%d개 파일을 삭제하고 %d개 파일의 이름을 변경합니다. 계속하시겠습니까?
DuplicateNames=새 파일 이름에 중복이 있습니다. 규칙을 확인하세요.
ConfirmRename=이름 변경을 실행하시겠습니까?
OperationResult=작업 완료: 삭제 %d개 (실패 %d개), 이름 변경 %d개 (실패 %d개).
AiGeneratedNames=AI가 %d개 파일에 대한 새 이름을 생성했습니다. 미리 보기를 확인하고 실행을 클릭하세요.
AiAssistant=AI 어시스턴트
SelectFilesFirst=먼저 파일을 선택하세요.
Ignore=무시
Unignore=무시 해제
Track=추적
Untrack=추적 해제
MarkDelete=삭제 표시
UnmarkDelete=표시 해제
ChangeExt=확장자 변경
RestoreExt=원래 확장자로 복원
MoveUpOne=위로 1개 이동
MoveUpTo=위로 이동...
MoveUpMenu=위로 이동
MoveDownOne=아래로 1개 이동
MoveDownTo=아래로 이동...
MoveDownMenu=아래로 이동
LocateInExplorer=탐색기에서 열기
AiAnalyze=AI 파일 이름 분석
CancelAiMark=AI 표시 취소
ResetAllConfirm=모든 변경 사항을 재설정하시겠습니까?\n\n접두사, 접미사, 바꾸기, 번호 매기기, 삭제 표시 및 AI 생성 이름이 재설정됩니다.
EnterNewExt=새 확장자 입력 (점 제외):
ChangeExtTitle=확장자 변경
InvalidExt=확장자에 잘못된 문자가 포함되어 있습니다.
LoadFolderFirst=먼저 폴더를 선택하여 파일 목록을 로드하세요.
NoFilesToRename=이름을 변경할 파일이 없습니다 (모든 파일이 무시되거나 삭제 표시됨).
SelectAll=모두 선택
DeselectAll=모두 선택 해제
AiDlgTitle=AI 일괄 이름 변경 어시스턴트
ColCurrentName=현재 파일 이름
ColAiSuggestion=AI 제안 새 이름
AiDlgStatus=%d개 파일을 로드했습니다. 아래에 이름 변경 요구 사항을 설명하세요.
AiDlgEnterDesc=이름 변경 요구 사항에 대한 설명을 입력하세요.
AiDlgWaiting=AI 응답 대기 중...
AiDlgEmptyResponse=AI 응답이 비어 있습니다.
AiDlgGenerated=AI가 %d개의 이름 변경 제안을 생성했습니다. 만족하면 \"적용\"을 클릭하세요.
AiDlgNoJson=AI 응답에서 유효한 JSON 데이터를 찾을 수 없습니다.
AiDlgParseError=AI가 구문 분석할 수 없는 내용을 반환했습니다. 다시 시도하거나 설명을 조정하세요.
AiDlgParseErrorTitle=구문 분석 오류
AiDlgInvalidJson=AI가 반환한 JSON 형식이 잘못되었습니다 (mappings 배열이 없음).
AiDlgWarning=참고:
AiDlgSkipped=- %d개 항목을 건너뜀 (파일을 찾을 수 없거나 이름이 변경되지 않음)
AiDlgIllegal=- %d개 파일 이름에 잘못된 문자가 포함되어 자동 정리됨
AiDlgDupFixed=- %d개 이름 충돌이 자동으로 접미사 추가로 해결됨
AiDlgProcessNote=처리 참고 사항
AiDlgJsonParseFail=JSON 구문 분석 실패: %hs
AiDlgUnchanged=(변경 없음)
AiDlgSendFirst=먼저 AI에 요청을 보내고 결과를 기다리세요.
AiDlgConflict=파일 이름 \"%s\"이(가) 이름이 변경되지 않은 기존 파일과 충돌합니다.\n설명을 조정하고 다시 시도하세요.
AiDlgConflictTitle=이름 충돌
AiDlgDuplicate=AI가 중복된 파일 이름 \"%s\"을(를) 생성했습니다.\n설명을 조정하고 다시 시도하세요.
AiDlgNoValidMapping=AI가 유효한 이름 변경 매핑을 생성하지 않았습니다.\n잘못되거나 중복된 항목 %d개를 건너뜁니다.
AiDlgCleanedIllegal=\n잘못된 문자가 포함된 %d개 파일 이름을 정리했습니다.
AiDlgDesc=이름 변경 요구 사항을 설명하세요 (자연어 지원):
AiDlgPreview=AI가 제안한 새 파일 이름 미리 보기:
BtnAiSend=AI로 보내기
BtnApply=적용
BtnCancel=취소
UndoConfirm=마지막 이름 변경 작업을 실행 취소하시겠습니까?
UndoResult=실행 취소 완료: %d 성공, %d 실패.
UndoTitle=실행 취소

[ProcessScan]
ColProcessName=프로세스 이름
ColPID=PID
ColSecurityLevel=보안 수준
ColDescription=분석 설명
BtnEnd=종료
BtnLocate=찾기
BtnEndAll=모두 종료
BtnStartScan=스캔 시작
LevelLabel=검토 수준
LevelConservative=보수적
LevelStandard=표준
LevelAggressive=공격적
RClickEnd=프로세스 종료
RClickLocate=찾기
RClickCopyPath=경로 복사
StatusReadyFormat=준비됨 - 검토 수준을 선택하고 \"%s\"을(를) 클릭하세요.
ScanCompleteMsg=스캔이 완료되었습니다. 결과를 확인하세요.

[QRCode]
InputPlaceholder=텍스트 또는 링크 입력...
BtnGenerate=QR 코드 생성
BtnCopy=클립보드에 복사
BtnSave=저장
LabelInput=텍스트 입력 (URL/텍스트):
EnterText=QR 코드에 사용할 텍스트를 입력하세요.
QrCopied=QR 코드가 클립보드에 복사되었습니다.
QrSaved=QR 코드가 저장되었습니다.
SaveTitle=QR 코드 저장
PngFilter=PNG 이미지 (*.png)|*.png|BMP 이미지 (*.bmp)|*.bmp||
[OCR]
BtnCapture=캡처 시작
BtnCopy=결과 복사
BtnTranslate=번역 >>
LangChinese=중국어
LangEnglish=영어
LangJapanese=일본어
LangKorean=한국어
LabelResult=인식 결과:
LabelTranslated=번역:
StatusHint=드래그하여 화면 영역을 선택하고 ESC를 눌러 취소하세요.
OcrBusy=OCR 또는 번역 중입니다. 기다려주세요...
PleaseCapture=먼저 텍스트를 캡처하세요.
Recognizing=인식 중입니다. 기다려주세요...
Translating=번역 중입니다. 기다려주세요...
NoContent=복사할 내용이 없습니다.
TranslateNoResponse=번역 실패: 응답이 없습니다.
TranslateEmptyResponse=번역 실패: 빈 응답입니다.
TranslateErrInitNetwork=번역 실패: 네트워크를 초기화할 수 없습니다.
TranslateErrConnectServer=번역 실패: 서버에 연결할 수 없습니다.
TranslateErrCreateRequest=번역 실패: 요청을 만들 수 없습니다.
TranslateErrTimeout=번역 실패: 요청 시간 초과 또는 네트워크 오류입니다.
TranslateErrPrefix=번역 실패:
TranslateErrParseResponse=번역 실패: 응답을 구문 분석할 수 없습니다.
TranslateErrResponseFormat=번역 실패: 응답 형식 오류입니다.
OcrTranslateFail=번역 실패: %s
Tip=팁
TranslateFailPrefix=번역 실패:
TranslateParseFail=번역 결과를 구문 분석하지 못했습니다.
CheckUseAiTranslate=AI 번역 사용
AiTranslateNoApiKey=AI 번역: API 키가 설정되지 않았습니다. 설정에서 구성하세요.
LangPair0=중국어 → 영어
LangPair1=중국어 → 일본어
LangPair2=중국어 → 한국어
LangPair3=영어 → 중국어
LangPair4=일본어 → 중국어
LangPair5=한국어 → 중국어
TranslateQueryLimitExceeded=텍스트가 너무 길어 MyMemory API가 거부했습니다. "AI 번역 사용"을 체크하고 다시 시도하세요.

[Markdown]
BtnOpen=열기
ExecuteBtn=실행
StatusReady=준비됨
PurposeLabel=목적:
RiskLevelLabel=위험 수준:
TerminalLabel=터미널: 
TerminalAuto=자동
CopyCode=복사
CodeCopied=복사됨
RiskLow=낮음
RiskMedium=중간
RiskHigh=높음
OpenFileTitle=Markdown 파일 열기
MdFilter=Markdown 파일 (*.md)|*.md|텍스트 파일 (*.txt)|*.txt|모든 파일 (*.*)|*.*||
FailedToOpen=파일을 열지 못했습니다.
FileTooLarge=파일이 너무 큽니다 (최대 10MB).
MarkdownTitle=Markdown 미리 보기 - %s
[Encoding]
FailedToOpen=파일을 열지 못했습니다.
FileTooLarge=파일이 너무 큽니다 (최대 10MB).
BtnOpen=열기
BtnSaveAs=다른 이름으로 저장
BtnOverwrite=덮어쓰기
BtnConvert=변환
TextFilter=텍스트 파일 (*.txt;*.md;*.csv;*.log)|*.txt;*.md;*.csv;*.log|모든 파일 (*.*)|*.*||
FailedToSave=파일을 저장하지 못했습니다.
NoFileLoaded=로드된 파일이 없습니다.
FileSaved=파일이 성공적으로 저장되었습니다.
NoOriginalFile=덮어쓸 원본 파일이 없습니다.
ConfirmOverwrite=원본 파일을 휴지통으로 이동하고 %s 인코딩으로 저장합니다.\n\n파일: %s\n\n계속하시겠습니까?
ConfirmOverwriteTitle=덮어쓰기 확인
FailedToMoveToRecycle=원본 파일을 휴지통으로 이동하지 못했습니다.
FileOverwritten=파일이 성공적으로 덮어쓰기되었습니다.
LabelSrcEnc=소스 인코딩
LabelDstEnc=대상 인코딩
[GitCmdDlg]
LabelWorkDir=작업 디렉터리:
LabelAiAsk=AI에게 질문:
BtnAiAsk=질문
LabelCmdList=명령어 목록 (우클릭하여 실행/복사/편집/삭제):
StatusReady=상태: 준비됨
LabelCmdInput=명령어 입력:
BtnCmdExecute=실행
BtnCmdInputClear=지우기
StatusAiGenerating=상태: AI 생성 중...
StatusAiGenResult=상태: AI가 %d개 명령어를 생성했습니다. 우클릭하여 실행하세요.
ColDesc=설명
ColCmd=명령어
BtnAddCmd=명령어 추가
BtnClearCmds=지우기
BtnCopyOutput=출력 복사
BtnClose=닫기
LabelTruncate=레이블 자르기:
BtnCount=개수: %d/%d
ConfirmDeleteMultiple=%d개 선택 항목을 삭제하시겠습니까?
RClickDeleteSelected=선택 항목 삭제 (%d)
RClickUpSelected=선택 항목 위로 이동 (%d)
RClickDownSelected=선택 항목 아래로 이동 (%d)
MaxItemsReached=최대 개수 (%d)에 도달하여 더 이상 추가할 수 없습니다.
OutputLabel=출력:
RClickExecute=실행
RClickCopy=명령어 복사
RClickEdit=명령어 편집
RClickDelete=명령어 삭제
RClickExecuteSelected=선택 항목 실행
RClickDeleteSelected=선택 항목 삭제
[GitExec]
ConfirmTitle=실행 확인
ConfirmMsg=다음 명령어를 실행하시겠습니까?\n\n명령어: %s\n작업 디렉터리: %s
ConfirmMsgBatch=%u개 명령어를 순차적으로 실행합니다. 작업 디렉터리: %s\n\n실행을 확인하시겠습니까?
Running=상태: 실행 중...
Done=상태: 완료됨
Failed=상태: 실행 실패
Cancelled=상태: 취소됨
[ConvHistory]
UnnamedTitle=제목 없는 대화
BtnClose=닫기
LabelTruncate=레이블 자르기:
BtnCount=개수: %d/%d
ConfirmDeleteMultiple=%d개 선택 항목을 삭제하시겠습니까?
RClickDeleteSelected=선택 항목 삭제 (%d)
RClickUpSelected=선택 항목 위로 이동 (%d)
RClickDownSelected=선택 항목 아래로 이동 (%d)
MaxItemsReached=최대 개수 (%d)에 도달하여 더 이상 추가할 수 없습니다.
ColTitle=제목
ColMessageCount=메시지 수
ColUpdated=업데이트됨
BtnLoad=로드
BtnRename=이름 변경
BtnDelete=삭제
BtnPath=저장 위치
RClickLoad=로드
RClickDelete=삭제
RClickRename=이름 변경
SaveLocation=저장 위치:
SelectConvFirst=먼저 대화를 선택하세요.
ConfirmDeleteConv=대화 \"%s\"을(를) 삭제하시겠습니까?
ConfirmDeleteTitle=삭제 확인
RenameTitle=대화 이름 변경
EnterNewTitle=새 대화 제목을 입력하세요:
DeleteMultiple=선택한 %d개 대화를 삭제하시겠습니까?
LoadSingleOnly=로드는 단일 선택만 지원합니다.
RenameSingleOnly=이름 변경은 단일 선택만 지원합니다.
[StickyNote]
BtnBrowse=찾아보기
RClickExit=메모 종료(&X)
SelectSaveDir=메모 저장 디렉터리 선택
[QuickBtn]
NextTrack=다음 트랙
[MainCtrl]
BtnRegex=정규식
BtnAiScan=AI 스캔
BtnRegexHelp=도움말
BtnNextTrack=다음 트랙
LabelShutdown=종료
BtnExecute=실행
BtnCancelShutdown=종료 취소
LabelHour=시
LabelMinute=분
LabelSecond=초
LabelVolume=볼륨
BtnApply=적용
BtnMute=음소거
LabelSystem=시스템
BtnTaskManager=작업 관리자
LabelCmdLine=명령어
LabelRunCmd=실행
BtnRun=실행
BtnClear=지우기
BtnSend=보내기
BtnStop=중지
BtnNewChat=새 채팅
BtnHistory=기록
BtnStandalone=독립 창
LabelLocateHint=\"찾기\"를 클릭한 다음 창을 대상으로 지정하세요.
GroupGenerate=복사
BtnGenerate=생성
BtnLocateWindow=찾기
DropHint=파일을 여기에 놓으세요.
CheckAutoStart=자동 시작
CheckTopmost=항상 위에 표시
CheckAutoClicker=자동 클리커
CheckPreventLock=잠금 방지
GroupRename=이름 변경
BtnModify=수정
BtnDelete=삭제
BtnCopyTo=복사 대상
BtnMoveTo=이동 대상
GroupCopyMove=복사 / 이동
GitDropHint=폴더 또는 파일 디렉터리를 여기에 놓으세요.
LabelHourUnit=시
LabelMinuteUnit=분
LabelSecondUnit=초
GroupFileHash=파일 해시
HashCalc=계산
HashCopy=복사
HashResult=해시 결과
[Volume]
BtnApply=적용
BtnMute=음소거
Btn10Percent=10%
OpenTaskMgr=작업 관리자
[RunCmd]
BtnRun=실행
BtnClear=지우기
InputPlaceholder=명령어 입력...
[ToolLaunch]
PowerShell=PowerShell
WSL=WSL
GitHub=GitHub
[Filter]
RegexCheck=정규식
RegexHelp=도움말
; ===== Menu translations =====
[Menu]
File=&파일
Settings=&설정...
Exit=종료(&X)
View=&보기
ViewProcess=&프로세스 관리
ViewStartup=&시작 프로그램 관리
ViewClipboard=&클립보드
ViewWindow=&창 도구
ViewFile=&파일 관리
ViewGit=&Git 도구 상자
Open=&열기
OpenPowerShell=&PowerShell
OpenWSL=&WSL
OpenGitBash=&Git Bash
Window=&창
WindowLocate=&창 찾기
WindowUntopmost=&모든 항상 위 해제
MenuMinimizeToTray=트레이로 최소화(&M)
WindowClose=&창 닫기
Tools=&도구
ToolsText=&텍스트 도구
ToolsMarkdown=&Markdown 미리 보기
ToolsEncoding=&인코딩 변환기
ToolsImage=&이미지 도구
ToolsQRCode=&QR 코드
ToolsScreenshotOCR=&스크린샷 OCR
ToolsFile=&파일 도구
ToolsBatchRename=&일괄 이름 변경
ToolsSystem=&시스템 도구
ToolsContextMenu=&컨텍스트 메뉴 관리자
ToolsEnvVar=&환경 변수
ToolsFileLock=&파일 잠금 뷰어
ToolsStickyNote=&메모장
AddStartup=시작 프로그램 항목 추가
DeleteStartup=시작 프로그램 항목 삭제
CopyPath=경로 복사
CopyValue=값 복사
Untopmost=항상 위 해제
Topmost=항상 위
Delete=삭제
Help=&도움말
HelpAbout=&프로그램 정보...
HelpShortcuts=&단축키
HelpRegex=&정규식 가이드
HelpGitHub=&GitHub
; ===== Dialog Captions =====
[DlgCaption]
AboutDlg=PowerBox 정보
MainDlg=PowerBox Toolbox
SettingsDlg=설정
ClickSpeedDlg=자동 클리커 속도
QRCodeDlg=QR 코드 생성기
OCRDlg=스크린샷 OCR
BatchRenameDlg=일괄 이름 변경 (폴더를 여기에 드래그)
InputDlg=입력
AIAssistantDlg=AI 어시스턴트
AiRenameDlg=AI 일괄 이름 변경 어시스턴트
RegexGuideDlg=정규식 가이드
StickyNoteDlg=메모장
MarkdownDlg=Markdown 미리 보기
EncodingDlg=인코딩 변환기
ContextMenuDlg=컨텍스트 메뉴 관리자
EnvVarDlg=환경 변수
EnvVarEditDlg=환경 변수
EnvVarPathEditDlg=PATH 변수 편집
FileLockDlg=파일 잠금 뷰어
ProcessScanDlg=AI 프로세스 스캔 결과
ProcessAiResultDlg=AI 프로세스 분석 결과
GitCmdDlg=Git 명령어
ConvHistoryDlg=대화 기록
[AboutDlg]
Version=PowerBox, 버전 1.0
Copyright=Copyright (C) 2026
BtnOK=확인
[Shortcut]
ShortcutListTitle=단축키
ShortcutList=Alt+1~6          - 탭 전환\nF5               - 현재 목록 새로 고침\n\n더 많은 기능은 보기/도구/창 메뉴를 참조하세요.
BtnCopy=결과 복사
BtnCount=개수: %d/%d
ConfirmDeleteMultiple=%d개 선택 항목을 삭제하시겠습니까?
RClickDeleteSelected=선택 항목 삭제 (%d)
RClickUpSelected=선택 항목 위로 이동 (%d)
RClickDownSelected=선택 항목 아래로 이동 (%d)
MaxItemsReached=최대 개수 (%d)에 도달하여 더 이상 추가할 수 없습니다.
[RegexGuide]
GuideContent========== 정규식 가이드 ==========\r\n\r\n이 도구는 C++ std::regex를 사용하며 기본 ECMAScript 구문을 사용합니다 (JavaScript 정규식과 호환).\r\n\r\n[기본 구문]\r\n  .        개행 문자를 제외한 모든 단일 문자\r\n  \\d       모든 숫자 [0-9]\r\n  \\D       숫자가 아닌 문자\r\n  \\w       영숫자 및 밑줄 [a-zA-Z0-9_]\r\n  \\W       단어 문자가 아닌 문자\r\n  \\s       공백 문자 (스페이스, 탭 등)\r\n  \\S       공백이 아닌 문자\r\n  [abc]    a, b 또는 c\r\n  [^abc]   a, b, c를 제외한 모든 문자\r\n  [a-z]    소문자 a부터 z까지\r\n\r\n[수량자]\r\n  *        0회 이상\r\n  +        1회 이상\r\n  ?        0회 또는 1회\r\n  {n}      정확히 n회\r\n  {n,}     n회 이상\r\n  {n,m}    n회에서 m회까지\r\n\r\n[앵커]\r\n  ^        문자열의 시작\r\n  $        문자열의 끝\r\n  \\b       단어 경계\r\n\r\n[그룹 및 바꾸기]\r\n  (pattern)      캡처 그룹, 바꾸기에서 참조\r\n  (?:pattern)    비캡처 그룹\r\n  $1, $2, ...    바꾸기에서 첫 번째, 두 번째 캡처 그룹 참조\r\n  $&             바꾸기에서 전체 일치 항목 참조\r\n\r\n[일반적인 예]\r\n  모든 숫자 제거:\r\n    찾기: \\d+    바꾸기: (비움)\r\n\r\n  선행 번호 제거 (예: \"01_\"):\r\n    찾기: ^\\d+_    바꾸기: (비움)\r\n\r\n  \"IMG_001\"을 \"Photo_001\"로 변경:\r\n    찾기: ^IMG    바꾸기: Photo\r\n\r\n  \"name_date\"를 \"date_name\"으로 교환:\r\n    찾기: ^(\\w+)_(\\w+)$    바꾸기: $2_$1\r\n\r\n  괄호 및 내용 제거:\r\n    찾기: \\(.*?\\)    바꾸기: (비움)\r\n\r\n  후행 번호 \"(1)\", \"(2)\" 제거:\r\n    찾기: \\(\\d+\\)$    바꾸기: (비움)\r\n\r\n  공백을 밑줄로 바꾸기:\r\n    찾기: \\s+    바꾸기: _\r\n\r\n[참고]\r\n  - 바꾸기는 파일 이름의 기본 부분 (확장자 제외)에만 적용됩니다.\r\n  - 확장자는 수정되지 않습니다.\r\n  - 정규식이 유효하지 않으면 바꾸기 규칙이 무시됩니다.\r\n  - 특수 문자는 이스케이프해야 함: . * + ? ( ) [ ] { } \\ ^ $ |
[QuickLaunch]
DlgTitle=빠른 실행 항목 관리
ColName=이름
ColType=유형
ColPath=경로
BtnAdd=추가
BtnEdit=편집
BtnDelete=삭제
BtnUp=위로 이동
BtnDown=아래로 이동
BtnBrowse=찾아보기
BtnCancel=취소
BtnOK=확인
AddTitle=빠른 실행 항목 추가
EditTitle=빠른 실행 항목 편집
NoSelection=먼저 항목을 선택하세요.
ConfirmDelete=\"%s\"을(를) 삭제하시겠습니까?
ConfirmDeleteTitle=삭제 확인
ItemNotFound=경로를 찾을 수 없음: %s
BtnManage=관리
BrowseFolder=폴더 선택
TypeExecutable=실행 파일
TypeFolder=폴더
TypeUrl=URL
TypeOtherFile=기타 파일
BtnChangeIcon=아이콘 변경
BtnResetIcon=기본값으로 재설정
SelectIconFile=아이콘 파일 선택
LabelName=이름:
LabelType=유형:
LabelPath=경로:
LabelHotkey=웨이크 핫키:
LabelIcon=아이콘:
BtnHotkey=캡처
TypeHotkeyOnly=핫키 전용
ColHotkey=핫키
RClickAdd=추가
RClickEdit=편집
RClickDelete=삭제
RClickUp=위로 이동
RClickDown=아래로 이동
DropHintManage=파일 또는 폴더를 여기에 놓아 빠르게 추가하세요.
DropHintAdd=파일 또는 폴더를 여기에 놓으세요.
BtnClose=닫기
LabelTruncate=레이블 자르기:
BtnCount=개수: %d/%d
ConfirmDeleteMultiple=%d개 선택 항목을 삭제하시겠습니까?
RClickDeleteSelected=선택 항목 삭제 (%d)
RClickUpSelected=선택 항목 위로 이동 (%d)
RClickDownSelected=선택 항목 아래로 이동 (%d)
MaxItemsReached=최대 개수 (%d)에 도달하여 더 이상 추가할 수 없습니다.

[Hotkey]
CaptureTitle=핫키 캡처
CapturePrompt=키 조합을 누르세요...
CaptureWaiting=키 대기 중...
BtnClear=지우기
KeySpace=스페이스
KeyEnter=Enter
None=없음

[Terminal]
Title=터미널
Shell=Shell
Clear=지우기
Copy=복사
Paste=붙여넣기
Restart=터미널 다시 시작
Exited=[프로세스 종료]

New=새 터미널
CloseTab=탭 닫기
